app/views/checklists/_checklist.html.erb

INSERT INTO "checklists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Add another"], ["user_id", 1], ["created_at", "2015-10-06 17:52:36.668291"], ["updated_at", "2015-10-06 17:52:36.668291"]]
---
     <small>
       Created at: <%= time_ago_in_words(checklist.created_at) %> ago