app/views/checklists/destroy.js.erb

DELETE FROM "checklists" WHERE "checklists"."id" = ?  [["id", 74]]
---
<% if @checklist.destroyed? %>