app/controllers/checklists_controller.rb

SELECT "checklists".* FROM "checklists"
---
  def create
     @checklist = current_user.checklists.build(checklist_params)

     # inspect the @checklist within the terminal.
     Rails.logger.info ">>>>>> checklist: #{@checklist.inspect}"

     if @checklist.save
       redirect_to checklists_path, notice: "Item was saved successfully."
     else
       @checklists = Checklist.all