app/controllers/checklists_controller.rb

SELECT "checklists".* FROM "checklists" WHERE "checklists"."user_id" = ?  [["user_id", 1]]
---
  def index
    if visible_to?(current_user)
      @checklists = current_user.checklists.all

INSERT INTO "checklists" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Add a new one now"], ["user_id", 1], ["created_at", "2015-10-02 19:22:46.806434"], ["updated_at", "2015-10-02 19:22:46.806434"]]
---
  def create
     @checklist = current_user.checklists.build(checklist_params)

     @new_checklist = Checklist.new

     # inspect the @checklist within the terminal.
     Rails.logger.info ">>>>>> checklist: #{@checklist.inspect}"

     if @checklist.save

SELECT  "checklists".* FROM "checklists" WHERE "checklists"."user_id" = ? AND "checklists"."id" = ? LIMIT 1  [["user_id", 1], ["id", 74]]
DELETE FROM "checklists" WHERE "checklists"."id" = ?  [["id", 74]]
---
  def destroy
     @checklist = current_user.checklists.find(params[:id])

     if @checklist.destroy